GT2/GT2/RANS/KOmegaSST_lowRE_V2/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10                                  	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          PCG;
	preconditioner 	DIC;
	tolerance	1e-8;
        relTol		0.01;

/*
        solver          GAMG;
        tolerance       1e-08;
        relTol          0;
        smoother        GaussSeidel;
        nPreSweeps      0;
        nPostSweeps     2;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 10;
        agglomerator    faceAreaPair;
        mergeLevels     1;
*/

	minIter 	3;
    }

    "(U|k|omega)"
    {

        //solver          PBiCG;
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          0;

/*
        solver          smoothSolver;
        smoother        GaussSeidel;
        nSweeps         2;
        tolerance       1e-08;
        relTol          0;
*/

	minIter		3;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 2;
    consistent yes;

    //pRefCell 0;
    //pRefValue 0;

    residualControl
    {
        p               1e-6;
        U               1e-6;
        "(k|omega)" 	1e-6;
    }
}

relaxationFactors
{
/*
    fields
    {
        p               0.3;
    }
    equations
    {
        U               0.7;
        k               0.7;
        omega           0.7;
    }
*/

    fields
    {
        p               1;
    }
    equations
    {
        p               1;
        U               0.9;
        k               0.8;
        omega           0.8;
    }

}

// ************************************************************************* //
