GT2/GT2/RANS/KOmegaSST_lowRE_V2/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10                                  	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type sets;
libs ("libsampling.so");

/*
cell
cellPatchConstrained
cellPoint
cellPointFace
cellPointWallModified
pointMVC
*/

//interpolationScheme cellPointFace;
interpolationScheme cellPoint;
//interpolationScheme cell;

setFormat       raw;

surfaceFormat 	raw;

// Fields to sample.
fields
(
    U
    wallShearStress
    //U.component(0) 
    p
    omega
    //epsilon
    k
    nut
);

/*
arcUniform
boundaryPoints
boundaryRandom
boxUniform
cellSet
circleRandom
faceSet
lineCell
lineCellFace
lineFace
lineUniform
points
sphereRandom
triSurfaceMesh
*/

sets
(

    profile0						
    {							
	type	lineCell;

	//type	lineUniform;
	//nPoints 1000;	
			
	axis 	distance; //y;	
	
	start		(	1.90334	0	0	);
	end		(	1.90334	0.1	0	);	//y 0.1				
    }							

    profile1						
    {							
	type	lineUniform;
	nPoints 1000;
	axis 	distance; //y;	

	start		(	-0.1	0	0	);
	end		(	2	0	0	);				
    }

);

surfaces
(
/*
    wallboundary
    {
        type            patch;
        patches         ( "bottom" );
    }
*/
);

// *********************************************************************** //
